app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-10-23 22:32:55.610392"], ["updated_at", "2016-10-23 22:32:55.610392"]]
---
  def create
    student = Student.create(params[:student])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["updated_at", "2016-10-26 14:14:50.491487"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(params[:student])